package by.academy.Lesson4;
//0. Создать массив типа String с размером 7.
//        Записать в него значения дней недели.
//        Вывести на консоль значение последнего элемента.
//
//        1. Создать массив типа double с размером 4.
//        Записать в него любые значения с помощью блока для инициализации.
//        Вывести на консоль значение первого элемента.
public class Massiv {
    public static void main(String[] args){
        String[] ned = new String[7];
        ned[0] = "Понед";
        ned[1] = "vt";
        ned[2] = "sr";
        ned[3] = "cht";
        ned[4] = "pt";
        ned[5] = "syb";
        ned[6] = "vs;";
        for (int i = 6; i <= 6; i++) {
            System.out.println(ned[i]);
        }
    }
}
